/**
 * Раздел справки, посвящённый форматированию списков желаний
 * @constant {string}
 */
const SharedHelpForeignListSection =
`*Список желаний*

В списке желаний других пользователей рядом с названиями подарков есть 2 эмодзи\\.
Первый обозначает статус:
🟢 — никто не выбирал,
🟡 — есть кооперация,
🔴 — забронировано\\.
Второй обозначает приоритет, где 1️⃣ — наивысшее значение\\.
Список отсортирован по приоритету\\.

Под описанием подарка можно найти либо список ссылок на участников кооперации, либо ссылку на забронировавшего, чтобы вы всегда могли договориться 😉`;

export default SharedHelpForeignListSection;
