/**
 * Раздел справки, посвящённый никнеймам
 * @constant {string}
 */
const SharedHelpNicknameSection =
`*Никнейм*

Если у пользователя, список которого вы смотрите или который участвует в кооперации или забронировал подарок, нет имени пользователя, он будет указан под случайным ником\\. Если у пользователя не скрыт аккаунт, ник будет кликабельным\\. Свой ник можно узнать, используя команду /my\\_nickname\\. Это может помочь найти владельца некликабельного ника 🙂`;

export default SharedHelpNicknameSection;
