const GroupHelpMessage =
`С помощью этого бота вы можете:
• смотреть списки желаний других пользователей:
  ◦ бронировать за собой подарки,
  ◦ отмечаться готовым к кооперации по подаркам,
  ◦ отменять участие в подарках,
• отправлять анонимные сообщения,
• получать на них ответы\\.
Бронирование предполагает самостоятельную реализацию подарка, кооперация — совместную\\.

В списке желаний других пользователей рядом с названиями подарков есть 2 эмодзи\\.
Первый обозначает статус:
🟢 — никто не выбирал,
🟡 — есть кооперация,
🔴 — забронировано\\.
Второй обозначает приоритет, где 1️⃣ — наивысшее значение\\.
Список отсортирован по приоритету\\.

Под описанием подарка можно найти либо список ссылок на участников кооперации, либо ссылку на забронировавшего, чтобы вы всегда могли договориться 😉

Если хотите, чтобы я закреплял сообщения со списками, обязательно сделайте меня администратором\\!

Список команд:
/list \\{username\\} — показать актуальный список пользователя,
/message \\{username\\} — отправить анонимное сообщение пользователю,
/help — справка\\.

В любой непонятной ситуации можете писать мне: \\@tmible`;

export default GroupHelpMessage;
