/**
 * Общий раздел справки для групповых чатов
 * @constant {string}
 */
const GroupHelpGeneralSection =
`*Общее*

С помощью этого бота вы можете:
• смотреть списки желаний других пользователей:
  ◦ бронировать за собой подарки,
  ◦ отмечаться готовым к кооперации по подаркам,
  ◦ отменять участие в подарках,
• отправлять анонимные сообщения,
• получать на них ответы\\.
Бронирование предполагает самостоятельную реализацию подарка, кооперация — совместную\\.

Если хотите, чтобы я закреплял сообщения со списками, обязательно сделайте меня администратором\\!`;

export default GroupHelpGeneralSection;
